backend/app/controllers/api/v1/monuments_controller.rb

  def index
    if params.slice(:lng, :lat, :range).size == 3
        out = Monument.close_to(params[:lng], params[:lat], params[:range])
    else
        out = Monument.all
---
SELECT "monuments".* FROM "monuments" WHERE (